OdRxMemberQueryEngine.removeReactor(OdRxMemberReactor*)
\details
Unregister a reactor.
\param pReactor [in] Reactor to be removed.

OdRxMemberQueryEngine.addReactor(OdRxMemberReactor*)
\details
Register a new reactor.
\param pReactor [in] Reactor to be registered.

OdRxMemberQueryEngine.removeFacetProvider(OdRxFacetProvider*)
\details
Unregister an extension provider.
\param pProvider [in] Facet provider to be removed.

OdRxMemberQueryEngine.addFacetProvider(OdRxFacetProvider*)
\details
Register a new facet provider (to provide extension classes with additional
members).
\param pProvider [in] Facet provider to be registered.

OdRxMemberQueryEngine.defaultContext
\details
Reference to the default query context.
Query context handles collecting members in a list.
\returns
Query context.

OdRxMemberQueryEngine.find(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.UInt16!System.Runtime.CompilerServices.IsConst*,OdRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Finds a member by name, uses defaultContext() if no context is passed.
\param pO           [in] Object to search the member in.
\param name         [in] Name of the member to be found.
\param pContext     [in] Context. Optional.
\param bQueryFacets [in] Flag determines if the function will query members
added dynamically by facet providers. Default value
is true.
\returns
Pointer to found member.